project_idea.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-08-23 Fri 10:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>chart management system project idea</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jake Bills" />
</head>
<body>
<div id="content">
<h1 class="title">chart management system project idea</h1>
<div class="abstract">
<p>
A searchable management system for pdf's of charts and leadsheets. Documents should be found by title, artist, genre, or band associated with.
</p>

</div>
<div id="outline-container-org5ebb999" class="outline-2">
<h2 id="org5ebb999"><span class="section-number-2">1</span> introduction</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org28edaa1" class="outline-3">
<h3 id="org28edaa1"><span class="section-number-3">1.1</span> This would be an organizational tool for musicians to manage their many leadsheets and charts that they produce. It should eventually include the ability to make a playlist.</h3>
</div>
</div>
<div id="outline-container-orgf2ab198" class="outline-2">
<h2 id="orgf2ab198"><span class="section-number-2">2</span> implementation</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org1ddba82" class="outline-3">
<h3 id="org1ddba82"><span class="section-number-3">2.1</span> This could be a rails web app, with a react front end. It would consist of a log in screen, a dashboard for your charts, a search bar, a drag and drop upload space&#x2026;</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-org3c0ac8f" class="outline-4">
<h4 id="org3c0ac8f"><span class="section-number-4">2.1.1</span> Documents would be stored via a cloudinary upload. Each document would belong to the user model and have the following data points: url, name, artist, group( deb, mb, thtrio,,,), genre, &amp;c</h4>
</div>
</div>
</div>
<div id="outline-container-org9755093" class="outline-2">
<h2 id="org9755093"><span class="section-number-2">3</span> steps</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org042bb64" class="outline-3">
<h3 id="org042bb64"><span class="section-number-3">3.1</span> <span class="todo TODO">TODO</span> write backend api in Rails</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-org937f2f8" class="outline-4">
<h4 id="org937f2f8"><span class="section-number-4">3.1.1</span> <span class="todo TODO">TODO</span> user model has many documents</h4>
</div>
<div id="outline-container-org738e41f" class="outline-4">
<h4 id="org738e41f"><span class="section-number-4">3.1.2</span> <span class="todo TODO">TODO</span> chart model (name, artist, group, genre) belonging to user</h4>
</div>
<div id="outline-container-org045308b" class="outline-4">
<h4 id="org045308b"><span class="section-number-4">3.1.3</span> <span class="todo TODO">TODO</span> chart model to have search method using sql.</h4>
</div>
<div id="outline-container-org5236079" class="outline-4">
<h4 id="org5236079"><span class="section-number-4">3.1.4</span> <span class="todo TODO">TODO</span> playlist model that has many charts</h4>
</div>
</div>
<div id="outline-container-orga434505" class="outline-3">
<h3 id="orga434505"><span class="section-number-3">3.2</span> <span class="todo TODO">TODO</span> write frontend in React</h3>
<div class="outline-text-3" id="text-3-2">
</div>
<div id="outline-container-org0bfe390" class="outline-4">
<h4 id="org0bfe390"><span class="section-number-4">3.2.1</span> <span class="todo TODO">TODO</span> login page</h4>
</div>
<div id="outline-container-orge102e27" class="outline-4">
<h4 id="orge102e27"><span class="section-number-4">3.2.2</span> <span class="todo TODO">TODO</span> dashboard</h4>
<div class="outline-text-4" id="text-3-2-2">
</div>
<ol class="org-ol">
<li><a id="org276429c"></a><span class="todo TODO">TODO</span> search tool<br /></li>
<li><a id="org07cfa19"></a><span class="todo TODO">TODO</span> index<br /></li>
</ol>
</div>
<div id="outline-container-org496a3f7" class="outline-4">
<h4 id="org496a3f7"><span class="section-number-4">3.2.3</span> <span class="todo TODO">TODO</span> pdf viewer</h4>
</div>
<div id="outline-container-org29a65c3" class="outline-4">
<h4 id="org29a65c3"><span class="section-number-4">3.2.4</span> <span class="todo TODO">TODO</span> playlists</h4>
</div>
</div>
</div>
<div id="outline-container-orgdcc17df" class="outline-2">
<h2 id="orgdcc17df"><span class="section-number-2">4</span> optional learning goals</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> write frontend in typescript</li>
<li class="off"><code>[&#xa0;]</code> write search functionality using SQL</li>
<li class="off"><code>[&#xa0;]</code> </li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jake Bills</p>
<p class="date">Created: 2019-08-23 Fri 10:38</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
